# 1. Використовуємо офіційний образ Node.js (версія 20)
FROM node:20

# 2. Створюємо робочу директорію всередині контейнера
WORKDIR /usr/src/app

# 3. Копіюємо файли package.json та package-lock.json для встановлення бібліотек
COPY package*.json ./

# 4. Встановлюємо всі залежності (express, helmet, node-cache тощо)
RUN npm install

# 5. Копіюємо весь інший код проекту в контейнер
COPY . .

# 6. Вказуємо порт, який використовує наш додаток
EXPOSE 3000

# 7. Команда для запуску нашого сервера
CMD [ "node", "server.js" ]